#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.network_security_group.data.modtm_module_source.telemetry[0]: Reading...
module.nat_gateway.data.modtm_module_source.telemetry[0]: Reading...
module.virtual_network.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Reading...
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.network_security_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=405f479e-6845-d3e5-ff6c-77231f52d77d]
module.virtual_network.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=95f09b6f-b3d1-d0c7-1969-1bf6eb79264a]
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.network_security_group.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.this: Reading...
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_subscription.current: Reading...
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=f982df00-7cc2-4fe3-a34f-4e97d500e2ce]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=8ee01287-a949-48f2-a15c-3891c494a8fa]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev]
module.resource_group.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.log_analytics_workspace.azurerm_log_analytics_workspace.this has changed
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
        name                                    = "law-crv-githublab-demo-dev"
      + tags                                    = {}
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.avm-utl-network-ip-addresses.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-utl-network-ip-addresses/azurerm"
          + "module_version"  = "0.1.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.avm-utl-network-ip-addresses.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.nat_gateway.azurerm_nat_gateway.this will be created
  + resource "azurerm_nat_gateway" "this" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "canadacentral"
      + name                    = "nat-crv-githublab-demo-dev"
      + resource_group_name     = "rg-crv-githublab-demo-dev"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
    }

  # module.nat_gateway.azurerm_nat_gateway_public_ip_association.this["default"] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "this" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.nat_gateway.azurerm_public_ip.this["default"] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 30
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "canadacentral"
      + name                    = "pip-nat-crv-githublab-demo-dev"
      + resource_group_name     = "rg-crv-githublab-demo-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.nat_gateway.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-natgateway/azurerm"
          + "module_version"  = "0.2.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.nat_gateway.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }
    }

  # module.network_security_group.azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "nsg-crv-githublab-demo-dev"
      + resource_group_name = "rg-crv-githublab-demo-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "env"  = "demo"
          + "type" = "avm"
        }
    }

  # module.network_security_group.azurerm_network_security_rule.this["no_internet"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Deny"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "block-internet-traffic"
      + network_security_group_name = "nsg-crv-githublab-demo-dev"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-crv-githublab-demo-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-networksecuritygroup/azurerm"
          + "module_version"  = "0.3.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.network_security_group.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.virtual_network.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.0.0.0/22",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = null
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "canadacentral"
      + name                      = "vnet-crv-githublab-demo-dev"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev"
      + schema_validation_enabled = true
      + tags                      = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + type                      = "Microsoft.Network/virtualNetworks@2023-11-01"
    }

  # module.virtual_network.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.virtual_network.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.8.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400"
          + "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
        }
    }

  # module.virtual_network.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.1.0/26",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "AzureBastionSubnet"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.1.64/28",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = {
                  + id = (known after apply)
                }
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "private_endpoints"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.0.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = {
                  + id = (known after apply)
                }
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "virtual_machines"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ resource_ids   = {
      + nat_gateway             = (known after apply)
      + nat_gateway_public_ip   = (known after apply)
      + network_security_group  = (known after apply)
      + virtual_network         = (known after apply)
        # (2 unchanged attributes hidden)
    }
  ~ resource_names = {
      + nat_gateway_name             = "nat-crv-githublab-demo-dev"
      + nat_gateway_public_ip_name   = "pip-nat-crv-githublab-demo-dev"
      + network_security_group_name  = "nsg-crv-githublab-demo-dev"
      + virtual_network_name         = "vnet-crv-githublab-demo-dev"
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*